Tekla Open API Reference for Tekla Structures 2025
VertexEnumerator.Current Property
 Returns the current vertex.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Current { get; }
Public ReadOnly Property Current As Point
	Get
Property Value
Type: Point
See Also
Reference
VertexEnumerator Class
Tekla.Structures.Solid Namespace